benchmark/results/20260920-064301/adaptive-ctrl-w1-r2.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms    1.02ms  12.80ms   84.48%
    Req/Sec    22.58k     1.60k   24.21k    88.67%
  Latency Distribution
     50%  665.00us
     75%    2.37ms
     90%    2.75ms
     99%    3.59ms
  673955 requests in 15.01s, 125.23MB read
  Non-2xx or 3xx responses: 382128
Requests/sec:  44911.37
Transfer/sec:      8.35MB