benchmark/results/20260920-064301/adaptive-ctrl-w4-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms  516.74us  15.21ms   75.20%
    Req/Sec    21.74k     0.89k   24.37k    84.33%
  Latency Distribution
     50%    1.00ms
     75%    1.36ms
     90%    1.66ms
     99%    2.35ms
  649186 requests in 15.01s, 112.13MB read
  Non-2xx or 3xx responses: 113400
Requests/sec:  43236.03
Transfer/sec:      7.47MB