benchmark/results/20260920-064301/adaptive-huge-w1-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.01ms  776.67us  12.93ms   70.42%
    Req/Sec     6.41k   501.70     8.59k    71.67%
  Latency Distribution
     50%    4.97ms
     75%    5.46ms
     90%    5.99ms
     99%    6.95ms
  191496 requests in 15.02s, 31.96MB read
Requests/sec:  12747.07
Transfer/sec:      2.13MB