benchmark/results/20260920-064301/adaptive-huge-w2-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.65ms    1.20ms  22.18ms   81.84%
    Req/Sec    12.31k     2.32k   17.68k    64.33%
  Latency Distribution
     50%    2.25ms
     75%    3.25ms
     90%    4.15ms
     99%    6.41ms
  367596 requests in 15.02s, 61.35MB read
Requests/sec:  24481.38
Transfer/sec:      4.09MB