benchmark/results/20260920-064301/adaptive-huge-w2-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.85ms    1.00ms  13.74ms   70.08%
    Req/Sec    11.32k     2.39k   16.72k    60.67%
  Latency Distribution
     50%    2.56ms
     75%    3.61ms
     90%    4.15ms
     99%    5.46ms
  337985 requests in 15.01s, 56.41MB read
Requests/sec:  22514.32
Transfer/sec:      3.76MB