benchmark/results/20260920-064301/adaptive-huge-w4-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms  682.09us  24.03ms   78.80%
    Req/Sec    16.71k     1.47k   19.31k    73.33%
  Latency Distribution
     50%    1.73ms
     75%    2.03ms
     90%    2.33ms
     99%    3.42ms
  499195 requests in 15.02s, 83.31MB read
Requests/sec:  33233.18
Transfer/sec:      5.55MB