benchmark/results/20260920-064301/adaptive-many16-w4-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62ms  605.24us  12.55ms   78.21%
    Req/Sec    17.24k     1.13k   19.55k    72.00%
  Latency Distribution
     50%    1.64ms
     75%    1.91ms
     90%    2.20ms
     99%    3.22ms
  514796 requests in 15.02s, 85.91MB read
Requests/sec:  34283.52
Transfer/sec:      5.72MB