benchmark/results/20260920-064301/adaptive-tiny-w1-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms  717.57us  44.70ms   95.97%
    Req/Sec    23.18k   749.87    25.11k    78.67%
  Latency Distribution
     50%    1.32ms
     75%    1.35ms
     90%    1.40ms
     99%    4.03ms
  692096 requests in 15.01s, 138.24MB read
  Non-2xx or 3xx responses: 681070
Requests/sec:  46114.56
Transfer/sec:      9.21MB