benchmark/results/20260920-064301/adaptive-tiny-w2-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms  708.87us  21.67ms   94.17%
    Req/Sec    20.83k     1.45k   22.92k    89.00%
  Latency Distribution
     50%    1.47ms
     75%    1.60ms
     90%    1.86ms
     99%    4.65ms
  621850 requests in 15.01s, 124.20MB read
  Non-2xx or 3xx responses: 611825
Requests/sec:  41429.95
Transfer/sec:      8.27MB