benchmark/results/20260920-064301/adaptive-tiny-w4-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   801.08us  345.29us  10.14ms   89.75%
    Req/Sec    20.91k   792.79    22.73k    75.00%
  Latency Distribution
     50%  752.00us
     75%  840.00us
     90%    0.95ms
     99%    2.32ms
  624361 requests in 15.01s, 124.04MB read
  Non-2xx or 3xx responses: 594385
Requests/sec:  41587.23
Transfer/sec:      8.26MB