benchmark/results/20260920-064301/baseline-w4-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms  641.79us  12.94ms   79.65%
    Req/Sec    18.18k     1.10k   21.23k    75.67%
  Latency Distribution
     50%    1.56ms
     75%    1.77ms
     90%    1.97ms
     99%    2.57ms
  543379 requests in 15.03s, 90.68MB read
Requests/sec:  36161.84
Transfer/sec:      6.03MB