benchmark/results/20260920-064301/fixed-w1-r2.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.98ms    0.99ms  18.92ms   78.36%
    Req/Sec     6.46k   531.70     9.12k    71.33%
  Latency Distribution
     50%    4.91ms
     75%    5.51ms
     90%    5.99ms
     99%    7.54ms
  193010 requests in 15.02s, 32.21MB read
Requests/sec:  12854.05
Transfer/sec:      2.15MB